Enums/ВидыОповещенийБюджетныхЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОповещенийБюджетныхЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПоступила</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПодходитСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПросрочена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОповещенийБюджетныхЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс 

// Функция формирует HTML текст оповещения по бюджетной задаче.
//
// Параметры:
//  ВидОповещения - ПеречислениеСсылка.ВидыОповещенийБюджетныхЗадач - Вид оповещения бюджетных задач.
//  Параметры - Структура - Параметры письма.
//   *Исполнитель - СправочникСсылка.Пользователи - Параметр исполнитель.
//   *БюджетнаяЗадача - ЗадачаСсылка.БюджетнаяЗадача - Параметр бюджетная задача.
//  КодЯзыкаИсполнителя - Строка - Код языка, на котором будет написано письмо исполнителю бюджетной задачи. 
//
// Возвращаемое значение:
//  Строка - Текст в формате HTML.
//
Функция ПолучитьПараметрыПисьмаПоШаблону(ВидОповещения, Параметры, КодЯзыкаИсполнителя) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Тема",      Неопределено);
	Результат.Вставить("Тело",      Неопределено);
	Результат.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
	Результат.Вставить("Кодировка", "UTF-8");
	Результат.Вставить("Важность",  Неопределено);
	
	Если ВидОповещения = Перечисления.ВидыОповещенийБюджетныхЗадач.ЗадачаПоступила Тогда
		Результат.Тема = НСтр("ru='Поступила новая задача';uk='Надійшла нова задача'",КодЯзыкаИсполнителя);
		Результат.Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
		
	ИначеЕсли ВидОповещения = Перечисления.ВидыОповещенийБюджетныхЗадач.ЗадачаПодходитСрок Тогда
		Результат.Тема = НСтр("ru='Подходит к концу срок исполнения задачи';uk='Добігає кінця термін виконання задачі'",КодЯзыкаИсполнителя);
		Результат.Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
		
	ИначеЕсли ВидОповещения = Перечисления.ВидыОповещенийБюджетныхЗадач.ЗадачаПросрочена Тогда
		Результат.Тема = НСтр("ru='Просрочено исполнение задачи';uk='Прострочено виконання задачі'",КодЯзыкаИсполнителя);
		Результат.Важность = ВажностьИнтернетПочтовогоСообщения.Наивысшая;
		
	КонецЕсли;
	
	ДобавитьТелоПисьма(ВидОповещения, Параметры, Результат, КодЯзыкаИсполнителя);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТелоПисьма(ВидОповещения, Параметры, Результат, КодЯзыкаИсполнителя)
	
	Реквизиты = Новый Структура("Пол", "ФизическоеЛицо.Пол");
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Исполнитель, Реквизиты);
	
	Параметры.Вставить("Обращение", НСтр("ru='Здравствуйте';uk='Доброго дня'",КодЯзыкаИсполнителя));
	Если Реквизиты.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		Параметры.Обращение = НСтр("ru='Уважаемый';uk='Шановний'",КодЯзыкаИсполнителя);
		
	ИначеЕсли Реквизиты.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
		Параметры.Обращение = НСтр("ru='Уважаемая';uk='Шановна'",КодЯзыкаИсполнителя);
		
	КонецЕсли;
	
	АдресПубликацииИнформационнойБазыВЛокальнойСети = 
		ОбщегоНазначения.АдресПубликацииИнформационнойБазыВЛокальнойСети();
	Если НЕ ПустаяСтрока(АдресПубликацииИнформационнойБазыВЛокальнойСети) Тогда
		АдресСсылки =
			АдресПубликацииИнформационнойБазыВЛокальнойСети + "#" +  ПолучитьНавигационнуюСсылку(Параметры.БюджетнаяЗадача);
		СсылкаНаЗадачу = НСтр("ru='Для просмотра задачи перейдите по ссылке: <a href=""%1"">%2</a>';uk='Для перегляду задачі перейдіть за посиланням: <a href=""%1""> %2</a>'",КодЯзыкаИсполнителя);
		СсылкаНаЗадачу = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СсылкаНаЗадачу, АдресСсылки, АдресСсылки);
		
	Иначе
		ИмяЯрлыкаИБ = НСтр("ru='Запустить информационную базу';uk='Запустити інформаційну базу'",КодЯзыкаИсполнителя);
		Результат.Вставить("ИмяЯрлыкаИБ", ИмяЯрлыкаИБ);
		СсылкаНаЗадачу = 
			НСтр("ru='Для того чтобы открыть информационную базу Вы можете воспользоваться вложенным файлом ""%1"".';uk='Для того, щоб відкрити інформаційну базу Ви можете скористатися вкладеним файлом ""%1"".'",КодЯзыкаИсполнителя);
		СсылкаНаЗадачу = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СсылкаНаЗадачу, ИмяЯрлыкаИБ);
	
	КонецЕсли;
	
	Параметры.Вставить("СсылкаНаЗадачу", СсылкаНаЗадачу);
	
	Если ВидОповещения = Перечисления.ВидыОповещенийБюджетныхЗадач.ЗадачаПоступила Тогда
		МакетШаблонаТекста = ПолучитьМакет("HTMLШаблонПисьмаПоступила");
	ИначеЕсли ВидОповещения = Перечисления.ВидыОповещенийБюджетныхЗадач.ЗадачаПодходитСрок Тогда
		МакетШаблонаТекста = ПолучитьМакет("HTMLШаблонПисьмаПодходитСрок");
	Иначе
		МакетШаблонаТекста = ПолучитьМакет("HTMLШаблонПисьмаПросрочено");
	КонецЕсли;
	МакетШаблонаТекста.КодЯзыкаМакета = КодЯзыкаИсполнителя;
	
	ТекстHTML = МакетШаблонаТекста.ПолучитьТекст();
	
	ТекстHTML = ЗаполнитьШаблонЗначениямиПодстановки(ТекстHTML, Параметры, КодЯзыкаИсполнителя);
	
	Результат.Тело = ТекстHTML;
	
КонецПроцедуры

Функция ЗаполнитьШаблонЗначениямиПодстановки(ШаблонТекста, ЗначенияПодстановки, КодЯзыкаИсполнителя)
	
	КодФорматнойСтроки = НСтр("ru='Л=ru_RU; ДЛФ=DD';uk='Л=uk_UA; ДЛФ=DD'",КодЯзыкаИсполнителя);
	
	Результат = ШаблонТекста;
	Для Каждого Параметр Из ЗначенияПодстановки Цикл
		Результат = СтрЗаменить(Результат, "[" + Параметр.Ключ + "]",
		                       ?(ТипЗнч(Параметр.Значение) = Тип("Дата"),
		                       Формат(Параметр.Значение, КодФорматнойСтроки), Параметр.Значение));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
